# Sin

## Description
Function Sin returns the sine of the specified value. The base value is assumed to represent an angle in radians.

```pascal
FUNCTION Sin(v : REAL) : REAL;
```

```python

def vs.Sin(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Numeric value for which to find the sine.|

## Version
Availability: from MiniCAD
## Category
* Math - General